---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalBeamHorizontalProjectionPlane
source: html/31689abc-d88a-13df-0e5f-10956e5f36f1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAnalyticalBeamHorizontalProjectionPlane Property

"Horizontal Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalyticalBeamHorizontalProjectionPlane { get; }
```